{
    "giraffe": [
      "Giraffes primarily inhabit savannas, grasslands, and open woodlands in Africa.",
      "The distinctive coat patterns of giraffes, like human fingerprints, are unique to each individual.",
      "Despite their ability to reach high into trees, giraffes tend to eat more leaves from smaller trees and bushes.",
      "In the wild, giraffes often form small groups known as \"tows,\" which usually consist of females and their young.",
      "As of my last knowledge update, many giraffe subspecies are listed under threatened categories on the IUCN Red List.",
      "The long necks of giraffes not only help in feeding but also in spotting predators from a distance.",
      "Female giraffes typically give birth to a single calf after a gestation period of approximately 450-460 days.",
      "Despite their towering height, giraffes can run at speeds of up to 35 miles per hour (56 kilometers per hour).",
      "Giraffes can go without water for long periods, but when they do drink, they spread their front legs wide apart to reach the ground.",
      "In some African cultures, giraffes are seen as symbols of good luck, prosperity, and peacefulness.",
      "Giraffes have a nearly 360-degree range of vision thanks to their uniquely positioned eyes, helping them detect predators from afar and observe their surroundings with ease.",
      "Unlike many other animals, giraffes typically sleep only about 4-5 hours in short intervals, often resting while standing and sometimes taking short naps lying down, which they do for just a few minutes at a time."
    ],
    "none": [
      "The next Mars rover is scheduled to launch in 2026 with a focus on searching for signs of past life.",
      "To prevent onions from making you cry while chopping, refrigerate them for about an hour beforehand.",
      "The first successful heart transplant was performed by Dr. Christiaan Barnard in 1967 at Groote Schuur Hospital in Cape Town.",
      "Single-use plastics are a major contributor to ocean pollution and global waste management issues.",
      "Quantum computing has the potential to solve complex problems that current computers cannot, or would take years to solve.",
      "The Grand Canyon is one of the most spectacular examples of erosion in the world, carved by the Colorado River.",
      "The piano was invented in the early 18th century by Bartolomeo Cristofori as an improvement over the harpsichord.",
      "Incorporating high-intensity interval training (HIIT) into your workout routine can significantly boost metabolism and endurance.",
      "The monarch butterfly migrates thousands of miles each year from Canada and the United States to Mexico, a journey spanning generations.",
      "Dolphins live in groups, called pods, which are known for their complex social structures and cooperative hunting behaviors.",
      "Polar bears have black skin under their white fur to absorb heat from the sun in the Arctic environment.",
      "The precise mechanism by which honeybees choose their new queen is still not fully understood, highlighting the complexity of their social hierarchy."
    ]
  }
  